Building configuration...

Current configuration : 2009 bytes
!
! Last configuration change at 21:41:09 UTC Mon May 1 2023 by u1
!
version 15.1
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
service compress-config
!
hostname sw2alex
!
boot-start-marker
boot-end-marker
!
!
logging discriminator EXCESS severity drops 6 msg-body drops EXCESSCOLL 
logging buffered 50000
logging console discriminator EXCESS
enable secret 4 tnhtc92DXBhelxjYk8LWJrPV36S2i4ntXrpb4RFmfqY
!
username u1 password 0 cisco
no aaa new-model
no ip icmp rate-limit unreachable
!
ip cef
!
!
no ip domain-lookup
ip domain-name cisco.com
no ipv6 cef
ipv6 multicast rpf use-bgp
!
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
!
!
!
vlan internal allocation policy ascending
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
!
!
!
!
interface Ethernet0/0
 duplex auto
!
interface Ethernet0/1
 duplex auto
!
interface Ethernet0/2
 switchport access vlan 30
 switchport mode access
 duplex auto
!
interface Ethernet0/3
 switchport access vlan 30
 switchport mode access
 duplex auto
!
interface Ethernet1/0
 switchport access vlan 40
 switchport mode access
 duplex auto
!
interface Ethernet1/1
 switchport access vlan 40
 switchport mode access
 duplex auto
!
interface Ethernet1/2
 no switchport
 ip address 22.1.1.2 255.255.255.0
!
interface Ethernet1/3
 duplex auto
!
interface Ethernet2/0
 duplex auto
!
interface Ethernet2/1
 duplex auto
!
interface Ethernet2/2
 duplex auto
!
interface Ethernet2/3
 duplex auto
!
interface Ethernet3/0
 duplex auto
!
interface Ethernet3/1
 duplex auto
!
interface Ethernet3/2
 duplex auto
!
interface Ethernet3/3
 duplex auto
!
interface Vlan1
 no ip address
 shutdown
!
!
no ip http server
!
!
!
!
snmp-server community public RO
!
control-plane
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 privilege level 15
 password cisco
 login local
 transport input ssh
!
end
configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
alex(config)#int range e0/0-1
                           ^
% Invalid input detected at '^' marker.

alex(config)#sw trunk encapsulation dot1q
              ^
% Invalid input detected at '^' marker.

alex(config)#sw mode trunk
              ^
% Invalid input detected at '^' marker.

alex(config)#exit
alex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
3swalex2(config)#int range e0/0-1
3swalex2(config-if-range)#sw trunk encapsulation dot1q
3swalex2(config-if-range)#sw mode trunk
3swalex2(config-if-range)#exit
3swalex2(config)#end
3swalex2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
sw2alex(config)#int range e0/0-1
sw2alex(config-if-range)#sw trunk encapsulation dot1q
sw2alex(config-if-range)#sw mode trunk
sw2alex(config-if-range)#exit
sw2alex(config)#end
sw2alex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
3swalex(config)#int range e0/0-1
3swalex(config-if-range)#sw trunk encapsulation dot1q
3swalex(config-if-range)#sw mode trunk
3swalex(config-if-range)#exit
3swalex(config)#end
3swalex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
swalex(config)#int range e0/0-1
swalex(config-if-range)#sw trunk encapsulation dot1q
swalex(config-if-range)#sw mode trunk
swalex(config-if-range)#exit
swalex(config)#end
swalex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
3swalex(config)#int range e0/0-1
3swalex(config-if-range)#sw trunk encapsulation dot1q
3swalex(config-if-range)#sw mode trunk
3swalex(config-if-range)#exit
3swalex(config)#end
3swalex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
sw2alex(config)#int range e0/0-1
sw2alex(config-if-range)#sw trunk encapsulation dot1q
sw2alex(config-if-range)#sw mode trunk
sw2alex(config-if-range)#exit
sw2alex(config)#end
sw2alex#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
3swalex2(config)#int range e0/0-1
3swalex2(config-if-range)#sw trunk encapsulation dot1q
3swalex2(config-if-range)#sw mode trunk
3swalex2(config-if-range)#exit
3swalex2(config)#end
3swalex2#